X = int(input())

d = [0] * 30001

d[1] = 0

for i in range(2, X + 1):
    while i != 1:
        # 1을 뺀 연산을 했다고 가정할 때의 연산 횟수
        d[i] = d[i - 1] + 1
        i -= 1

        # 1을 빼지 않을 때의 연산 횟수
        if (i + 1) % 2 == 0:
            d[i+1] = min(d[i+1], d[(i+1)//2] + 1)
            i = (i + 1) // 2
        if (i + 1) % 3 == 0:
            d[i+1] = min(d[i+1], d[(i+1)//3] + 1)
            i = (i + 1) // 3
        if (i + 1) % 5 == 0:
            d[i+1] = min(d[i+1], d[(i+1)//5] + 1)
            i = (i + 1) // 5

print(d[X])